yuhki50/esp32-camera/sensors/ov5642.c
/*
   This file is part of the OpenMV project.
   Copyright (c) 2013/2014 Ibrahim Abdelkader <i.abdalkader@gmail.com>
   This work is licensed under the MIT license, see the file LICENSE for details.

   OV3660 driver.

*/
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include "sccb.h"
#include "ov5642.h"
#include "ov5642_regs.h"
#include "ov5642_settings.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#else
#include "esp_log.h"
static const char *TAG = "ov5642";
#endif

//#define REG_DEBUG_ON

static int read_reg(uint8_t slv_addr, const uint16_t reg) {
  int ret = SCCB_Read16(slv_addr, reg);
#ifdef REG_DEBUG_ON
  if (ret < 0) {
    ESP_LOGE(TAG, "READ REG 0x%04x FAILED: %d", reg, ret);
  }
#endif
  return ret;
}

static int check_reg_mask(uint8_t slv_addr, uint16_t reg, uint8_t mask) {
  return (read_reg(slv_addr, reg) & mask) == mask;
}

static int read_reg16(uint8_t slv_addr, const uint16_t reg) {
  int ret = 0, ret2 = 0;
  ret = read_reg(slv_addr, reg);
  if (ret >= 0) {
    ret = (ret & 0xFF) << 8;
    ret2 = read_reg(slv_addr, reg + 1);
    if (ret2 < 0) {
      ret = ret2;
    } else {
      ret |= ret2 & 0xFF;
    }
  }
  return ret;
}


static int write_reg(uint8_t slv_addr, const uint16_t reg, uint8_t value) {
  int ret = 0;
#ifndef REG_DEBUG_ON
  ret = SCCB_Write16(slv_addr, reg, value);
#else
  int old_value = read_reg(slv_addr, reg);
  if (old_value < 0) {
    return old_value;
  }
  if ((uint8_t)old_value != value) {
    ESP_LOGI(TAG, "NEW REG 0x%04x: 0x%02x to 0x%02x", reg, (uint8_t)old_value, value);
    ret = SCCB_Write16(slv_addr, reg, value);
  } else {
    ESP_LOGD(TAG, "OLD REG 0x%04x: 0x%02x", reg, (uint8_t)old_value);
    ret = SCCB_Write16(slv_addr, reg, value);//maybe not?
  }
  if (ret < 0) {
    ESP_LOGE(TAG, "WRITE REG 0x%04x FAILED: %d", reg, ret);
  }
#endif
  return ret;
}

static int set_reg_bits(uint8_t slv_addr, uint16_t reg, uint8_t offset, uint8_t mask, uint8_t value) {
  int ret = 0;
  uint8_t c_value, new_value;
  ret = read_reg(slv_addr, reg);
  if (ret < 0) {
    return ret;
  }
  c_value = ret;
  new_value = (c_value & ~(mask << offset)) | ((value & mask) << offset);
  ret = write_reg(slv_addr, reg, new_value);
  return ret;
}

static int write_regs(uint8_t slv_addr, const uint16_t (*regs)[2])
{
  int i = 0, ret = 0;
  while (!ret && regs[i][0] != REGLIST_TAIL) {
    if (regs[i][0] == REG_DLY) {
      vTaskDelay(regs[i][1] / portTICK_PERIOD_MS);
    } else {
      ret = write_reg(slv_addr, regs[i][0], regs[i][1]);
    }
    i++;
  }
  return ret;
}

static int write_reg16(uint8_t slv_addr, const uint16_t reg, uint16_t value)
{
  if (write_reg(slv_addr, reg, value >> 8) || write_reg(slv_addr, reg + 1, value)) {
    return -1;
  }
  return 0;
}

static int write_addr_reg(uint8_t slv_addr, const uint16_t reg, uint16_t x_value, uint16_t y_value)
{
  if (write_reg16(slv_addr, reg, x_value) || write_reg16(slv_addr, reg + 2, y_value)) {
    return -1;
  }
  return 0;
}

#define write_reg_bits(slv_addr, reg, mask, enable) set_reg_bits(slv_addr, reg, 0, mask, enable?mask:0)

int ov5642_calc_sysclk(int xclk, bool pll_bypass, int pll_multiplier, int pll_sys_div, int pll_pre_div, bool pll_root_2x, int pll_seld5, bool pclk_manual, int pclk_div)
{
  const int pll_pre_div2x_map[] = { 2, 3, 4, 5, 6, 8, 12, 16 };//values are multiplied by two to avoid floats
  const int pll_seld52x_map[] = { 2, 2, 4, 5 };

  if (!pll_sys_div) {
    pll_sys_div = 1;
  }

  int pll_pre_div2x = pll_pre_div2x_map[pll_pre_div];
  int pll_root_div = pll_root_2x ? 2 : 1;
  int pll_seld52x = pll_seld52x_map[pll_seld5];

  int VCO = (xclk / 1000) * pll_multiplier * pll_root_div * 2 / pll_pre_div2x;
  int PLLCLK = pll_bypass ? (xclk) : (VCO * 1000 * 2 / pll_sys_div / pll_seld52x);
  int PCLK = PLLCLK / 2 / ((pclk_manual && pclk_div) ? pclk_div : 1);
  int SYSCLK = PLLCLK / 4;

  ESP_LOGD(TAG, "Calculated VCO: %d KHz, PLLCLK: %d KHz, SYSCLK: %d KHz, PCLK: %d KHz", VCO, PLLCLK / 1000, SYSCLK / 1000, PCLK / 1000);
  return SYSCLK;
}

static int set_pll(sensor_t *sensor, bool bypass, uint8_t multiplier, uint8_t sys_div, uint8_t pre_div, bool root_2x, uint8_t seld5, bool pclk_manual, uint8_t pclk_div) {
  int ret = 0;
  if (multiplier > 31 || sys_div > 15 || pre_div > 7 || pclk_div > 31 || seld5 > 3) {
    ESP_LOGE(TAG, "Invalid arguments");
    return -1;
  }

  // ret = set_pll(sensor, bypass = false, multiplier = 12, sys_div = 1, pre_div = 3, false, 0, true, 2);
  ov5642_calc_sysclk(sensor->xclk_freq_hz, bypass, multiplier, sys_div, pre_div, root_2x, seld5, pclk_manual, pclk_div);
  ret = write_reg(sensor->slv_addr, SC_PLLS_CTRL0, (root_2x ? 0x04 : 0x00) | seld5); // 0x00
  if (ret == 0) {
    ret = write_reg(sensor->slv_addr, SC_PLLS_CTRL1, (sys_div & 0x0f) << 4); //
  }
  if (ret == 0) {
    ret = write_reg(sensor->slv_addr, SC_PLLS_CTRL2, (bypass ? 0x80 : 0x00) | (pclk_div & 0x3f)); // OK
  }
  if (ret == 0) {
    ret = write_reg(sensor->slv_addr, SC_PLLS_CTRL3, (pre_div & 0x7)); // OK
  }
  if (ret == 0) {
    ret = write_reg(sensor->slv_addr, PCLK_RATIO, multiplier  & 0x1F);
  }
  if (ret == 0) {
    ret = write_reg(sensor->slv_addr, VFIFO_CTRL0C, pclk_manual ? 0x22 : 0x20);
  }
  if (ret) {
    ESP_LOGE(TAG, "set_sensor_pll FAILED!");
  }
  return ret;
}

static int set_ae_level(sensor_t *sensor, int level);

static void check_clock(sensor_t *sensor) {
  uint8_t i;
  uint8_t pll_ctrl[4];
  for (i = 0; i < 4; i++) {
    pll_ctrl[i] = read_reg(sensor->slv_addr, 0x300F + i);
  }
  uint8_t PLL_SELD5_MAP[4] = {1, 1, 4, 5};
  double PLL_PRE_DIV2X_MAP[8] = {2, 3, 4, 5, 6, 8, 12, 16};
  bool PLL_BYPASS;
  uint8_t PLL_DIVL, PLL_SELD5_RAW, PLL_DIVS, PLL_DIVM, PLL_DIVP, PLL_PRE_DIV2X_RAW;
  uint8_t PLL_SELD5, PLL_PRE_DIV2X;

  bool FROM_PRE_DIV = (read_reg(sensor->slv_addr, 0x3103) & 0x02) >> 1 ? true : false;

  PLL_PRE_DIV2X_RAW = pll_ctrl[3] & 0x07;
  PLL_SELD5_RAW = pll_ctrl[0] & 0x03;

