yuhki50/esp32-camera/sensors/ov5642.c
  PLL_DIVL = (pll_ctrl[0] & 0x04) >> 2;                 // ----
  PLL_SELD5 = PLL_SELD5_MAP[PLL_SELD5_RAW];             // Used
  PLL_DIVS = (pll_ctrl[1] & 0xF0) >> 4;                 // Used
  PLL_DIVM = (pll_ctrl[1] & 0x0F);                      // ---- <- for MIPI
  PLL_BYPASS = pll_ctrl[2] & 0x80 ? true : false;       // Used
  PLL_DIVP = pll_ctrl[2] & 0x3F;                        // Used
  PLL_PRE_DIV2X = PLL_PRE_DIV2X_MAP[PLL_PRE_DIV2X_RAW]; // Used

  ESP_LOGD(TAG, "PLL DIVL[%hhu] SELD5[%hhu] DIVS[%hhu] DIVM[%hhu] BYPASS[%hhu] DIVP[%hhu] PRE_DIV2X[%hhu] FROM_PRE_DIV[%hhu]", PLL_DIVL, PLL_SELD5, PLL_DIVS, PLL_DIVM, PLL_BYPASS?1:0, PLL_DIVP, PLL_PRE_DIV2X, FROM_PRE_DIV?1:0);

  uint32_t XCLK = sensor->xclk_freq_hz;
  uint32_t PLLCLK = PLL_BYPASS ? XCLK : (FROM_PRE_DIV ? XCLK * PLL_PRE_DIV2X / 2 : XCLK);
  uint32_t VCO = PLLCLK * PLL_DIVP * PLL_SELD5;
  uint32_t SYSCLK = PLLCLK * PLL_DIVP / (PLL_DIVS?PLL_DIVS:1) / 4;

  ESP_LOGD(TAG, "XCLK[%uMHz] PLLCLK[%uMHz] VCO[%uMHz] SYSCLK[%uMHz]", XCLK/1000000, PLLCLK/1000000, VCO/1000000, SYSCLK/1000000);

  // int VCO = (xclk / 1000) * pll_multiplier * pll_root_div * 2 / pll_pre_div2x;
  // int PLLCLK = pll_bypass ? (xclk) : (VCO * 1000 * 2 / pll_sys_div / pll_seld52x);
  // int PCLK = PLLCLK / 2 / ((pclk_manual && pclk_div) ? pclk_div : 1);
  // int SYSCLK = PLLCLK / 4;

}

// OV5642 COMAPTIBLE
static int reset(sensor_t *sensor)
{
  int ret = 0;
  // Software Reset: clear all registers and reset them to their default values
  ret = write_reg(sensor->slv_addr, SYSTEM_CTROL0, 0x82);
  if (ret) {
    ESP_LOGE(TAG, "Software Reset FAILED!");
    return ret;
  }
  vTaskDelay(100 / portTICK_PERIOD_MS);
  ret = write_regs(sensor->slv_addr, ov5642_sensor_default_regs);
  if (ret == 0) {
    ESP_LOGD(TAG, "Camera defaults loaded");
    ret = set_ae_level(sensor, 0);
    vTaskDelay(100 / portTICK_PERIOD_MS);
  }
  ret = write_regs(sensor->slv_addr, ov5642_auto_focus_regs);
  ret != write_reg(sensor->slv_addr, 0x3f00, 0x03);
  if (ret == 0) {
    write_reg(sensor->slv_addr, 0x3025, 0x01);
    write_reg(sensor->slv_addr, 0x3024, 0x10);
    ESP_LOGD(TAG, "Auto Focus Initiated");
  }

  // check_clock(reset);

  return ret;
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat) {
  int ret = 0;
  const uint16_t (*regs)[2];

  switch (pixformat) {
    case PIXFORMAT_YUV422:
      regs = ov5642_sensor_fmt_yuv422;
      break;

    case PIXFORMAT_GRAYSCALE:
      regs = ov5642_sensor_fmt_grayscale;
      break;

    case PIXFORMAT_RGB565:
    case PIXFORMAT_RGB888:
      regs = ov5642_sensor_fmt_rgb565;
      break;

    case PIXFORMAT_JPEG:
      regs = ov5642_sensor_fmt_jpeg;
      break;

    case PIXFORMAT_RAW:
      regs = ov5642_sensor_fmt_raw;
      break;

    default:
      ESP_LOGE(TAG, "Unsupported pixformat: %u", pixformat);
      return -1;
  }

  ret = write_regs(sensor->slv_addr, regs);
  if (ret == 0) {
    sensor->pixformat = pixformat;
    ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
  }
  return ret;
}

// OV5642 compatible
static int set_image_options(sensor_t *sensor) {
  int ret = 0;
  uint8_t reg18 = 0;
  uint8_t x_bin = 0;
  uint8_t y_bin = 0;

  // enable compression
  if (sensor->pixformat == PIXFORMAT_JPEG) {
    reg18 |= 0x80;
  }

  // binning for small framsizes
  if (sensor->status.framesize <= FRAMESIZE_SVGA) {
    x_bin |= 0x40;
    y_bin |= 0x80;
  }

  // V-Flip
  if (sensor->status.vflip) {
    reg18 |= 0x80;
  }

  // H-Mirror
  if (sensor->status.hmirror) {
    reg18 |= 0x40;
  }

  if (write_reg(sensor->slv_addr, TIMING_TC_REG18, reg18)
      || write_reg(sensor->slv_addr, ANALOG_CONTROL_D, y_bin)
      || write_reg(sensor->slv_addr, ARRAY_CONTROL01, x_bin)) {
    ESP_LOGE(TAG, "Setting Image Options Failed");
    ret = -1;
  }

  ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u",
           sensor->pixformat == PIXFORMAT_JPEG, sensor->status.framesize <= FRAMESIZE_SVGA, sensor->status.vflip, sensor->status.hmirror);
  return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
  int ret = 0;
  framesize_t old_framesize = sensor->status.framesize;
  sensor->status.framesize = framesize;

  if (framesize >= FRAMESIZE_INVALID) {
    ESP_LOGE(TAG, "Invalid framesize: %u", framesize);
    return -1;
  }
  uint16_t w = resolution[framesize][0];
  uint16_t h = resolution[framesize][1];

  //  if (framesize > FRAMESIZE_SVGA) {
  //    ret  = write_reg(sensor->slv_addr, 0x4520, 0xb0)
  //           || write_reg(sensor->slv_addr, X_INCREMENT, 0x11)//odd:1, even: 1
  //           || write_reg(sensor->slv_addr, Y_INCREMENT, 0x11);//odd:1, even: 1
  //  } else {
  //    ret  = write_reg(sensor->slv_addr, 0x4520, 0x0b)
  //           || write_reg(sensor->slv_addr, X_INCREMENT, 0x31)//odd:3, even: 1
  //           || write_reg(sensor->slv_addr, Y_INCREMENT, 0x31);//odd:3, even: 1
  //  }
  //
  //  if (ret) {
  //    goto fail;
  //  }

  ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, 432, 10)
         || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, 2592, 1944) // 0x3804, 0x3805, 0x3806, 0x3807 to 2079 and 1547
         || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h); // 0x3808, 0x3809, 0x380A, 0x380B to w and h

  if (ret) {
    goto fail;
  }

  if (framesize > FRAMESIZE_SVGA) {
    ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 3200, 2000)
           || write_reg(sensor->slv_addr, XY_OFFSET, ((12 & 0x0F) << 4) | (2 & 0x0F));
  } else {
    if (framesize == FRAMESIZE_SVGA) {
      ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 3200, 1000);
    } else {
      ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 1600, 500);
    }
    if (ret == 0) {
      ret = write_reg(sensor->slv_addr, XY_OFFSET, ((12 & 0x0F) << 4) | (2 & 0x0F));
    }
  }

  if (ret == 0) {
    if (framesize == FRAMESIZE_QSXGA) {
      write_reg(sensor->slv_addr, ISP_CONTROL_01, 0x4f);
    } else {
      write_reg(sensor->slv_addr, ISP_CONTROL_01, 0x7f);
    }
  }

  if (ret == 0) {
    ret = set_image_options(sensor);
  }

  if (ret) {
    goto fail;
  }

