yuhki50/esp32-camera/sensors/ov5642.c
  // set_pll(sensor_t *sensor, bool bypass, uint8_t multiplier, uint8_t sys_div, uint8_t pre_div, bool root_2x, uint8_t seld5, bool pclk_manual, uint8_t pclk_div)
  if (sensor->pixformat == PIXFORMAT_JPEG) {
    if (framesize == FRAMESIZE_QSXGA) {
      // TODO !!! PLLの調整 をするところです
      //      write_reg(sensor->slv_addr, 0x3103, 0x03);
      ret = set_pll(sensor, false, 12, 1, 3, false, 0, true, 2);
      //      write_reg(sensor->slv_addr, 0x3011, 0x00);
      //      write_reg(sensor->slv_addr, 0x3012, 0x00);
      //      write_reg(sensor->slv_addr, 0x3010, 0x10);
      //      write_reg(sensor->slv_addr, 0x460C, 0x22);
    } else if (framesize == FRAMESIZE_QXGA) {
      //40MHz SYSCLK and 10MHz PCLK
      ret = set_pll(sensor, false, 24, 1, 3, false, 0, true, 8);
    } else {
      //50MHz SYSCLK and 10MHz PCLK
      ret = set_pll(sensor, false, 30, 1, 3, false, 0, true, 10);
    }
  } else {
    if (framesize > FRAMESIZE_CIF) {
      //10MHz SYSCLK and 10MHz PCLK (6.19 FPS)
      ret = set_pll(sensor, false, 2, 1, 0, false, 0, true, 2);
    } else {
      //25MHz SYSCLK and 10MHz PCLK (15.45 FPS)
      ret = set_pll(sensor, false, 5, 1, 0, false, 0, true, 5);
    }
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
  }
  return ret;

fail:
  sensor->status.framesize = old_framesize;
  ESP_LOGE(TAG, "Setting framesize to: %ux%u failed", w, h);
  return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
  int ret = 0;
  sensor->status.hmirror = enable;
  ret = set_image_options(sensor);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
  }
  return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
  int ret = 0;
  sensor->status.vflip = enable;
  ret = set_image_options(sensor);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set v-flip to: %d", enable);
  }
  return ret;
}

// OV5642 COMPATIBLE
static int set_quality(sensor_t *sensor, int qs)
{
  int ret = 0;
  ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);
  if (ret == 0) {
    sensor->status.quality = qs;
    ESP_LOGD(TAG, "Set quality to: %d", qs);
  }
  return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);
  if (ret == 0) {
    sensor->status.colorbar = enable;
    ESP_LOGD(TAG, "Set colorbar to: %d", enable);
  }
  return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AGC_MANUALEN, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
    sensor->status.agc = enable;
  }
  return ret;
}

static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AEC_MANUALEN, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set exposure_ctrl to: %d", enable);
    sensor->status.aec = enable;
  }
  return ret;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x01, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set awb to: %d", enable);
    sensor->status.awb = enable;
  }
  return ret;
}

//Advanced AWB
static int set_dcw_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5183, 0x80, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set dcw to: %d", enable);
    sensor->status.dcw = enable;
  }
  return ret;
}

//night mode enable
static int set_aec2(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x3a00, 0x04, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set aec2 to: %d", enable);
    sensor->status.aec2 = enable;
  }
  return ret;
}

static int set_bpc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x04, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set bpc to: %d", enable);
    sensor->status.bpc = enable;
  }
  return ret;
}

static int set_wpc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x02, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set wpc to: %d", enable);
    sensor->status.wpc = enable;
  }
  return ret;
}

//Gamma enable
static int set_raw_gma_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x20, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set raw_gma to: %d", enable);
    sensor->status.raw_gma = enable;
  }
  return ret;
}

static int set_lenc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x80, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set lenc to: %d", enable);
    sensor->status.lenc = enable;
  }
  return ret;
}

static int get_agc_gain(sensor_t *sensor)
{
  int ra = read_reg(sensor->slv_addr, 0x350a);
  if (ra < 0) {
    return 0;
  }
  int rb = read_reg(sensor->slv_addr, 0x350b);
  if (rb < 0) {
    return 0;
  }
  int res = (rb & 0xF0) >> 4 | (ra & 0x03) << 4;
  if (rb & 0x0F) {
    res += 1;
  }
  return res;
}

//real gain
static int set_agc_gain(sensor_t *sensor, int gain)
{
  int ret = 0;
  if (gain < 0) {
    gain = 0;
  } else if (gain > 64) {
    gain = 64;
  }

  //gain value is 6.4 bits float
  //in order to use the max range, we deduct 1/16
  int gainv = gain << 4;
  if (gainv) {
    gainv -= 1;
  }

  ret = write_reg(sensor->slv_addr, 0x350a, gainv >> 8) || write_reg(sensor->slv_addr, 0x350b, gainv & 0xff);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set agc_gain to: %d", gain);
    sensor->status.agc_gain = gain;
  }
  return ret;
}

static int get_aec_value(sensor_t *sensor)
{
  int ra = read_reg(sensor->slv_addr, 0x3500);
  if (ra < 0) {
    return 0;
  }
  int rb = read_reg(sensor->slv_addr, 0x3501);
  if (rb < 0) {
    return 0;
  }
  int rc = read_reg(sensor->slv_addr, 0x3502);
  if (rc < 0) {
    return 0;
  }
  int res = (ra & 0x0F) << 12 | (rb & 0xFF) << 4 | (rc & 0xF0) >> 4;
  return res;
}

static int set_aec_value(sensor_t *sensor, int value)
{
  int ret = 0, max_val = 0;
  max_val = read_reg16(sensor->slv_addr, 0x380e);
  if (max_val < 0) {
    ESP_LOGE(TAG, "Could not read max aec_value");
    return -1;
  }
  if (value > max_val) {
    value = max_val;
  }

  ret =  write_reg(sensor->slv_addr, 0x3500, (value >> 12) & 0x0F)
         || write_reg(sensor->slv_addr, 0x3501, (value >> 4) & 0xFF)
         || write_reg(sensor->slv_addr, 0x3502, (value << 4) & 0xF0);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set aec_value to: %d / %d", value, max_val);
    sensor->status.aec_value = value;
  }
  return ret;
}

// OV5642 COMPATIBLE
static int set_ae_level(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level < -5 || level > 5) {
    return -1;
  }
  //good targets are between 5 and 115
  int target_level = ((level + 5) * 10) + 5;

  int level_high, level_low;
  int fast_high, fast_low;

  level_low = target_level * 23 / 25; //0.92 (0.46)
  level_high = target_level * 27 / 25; //1.08 (2.08)

  fast_low = level_low >> 1;
  fast_high = level_high << 1;

  if (fast_high > 255) {
    fast_high = 255;
  }

  ret =  write_reg(sensor->slv_addr, 0x3a0f, level_high)
         || write_reg(sensor->slv_addr, 0x3a10, level_low)
         || write_reg(sensor->slv_addr, 0x3a1b, level_high)
         || write_reg(sensor->slv_addr, 0x3a1e, level_low)
         || write_reg(sensor->slv_addr, 0x3a11, fast_high)
         || write_reg(sensor->slv_addr, 0x3a1f, fast_low);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set ae_level to: %d", level);
    sensor->status.ae_level = level;
  }
  return ret;
}

